*-----------------------------------------------------------
* Title      :
* Written by :
* Date       :
* Description:
*-------------------------前端------------------------------------------------------
        ORG    $2aebe
        jsr    $180800
        nop
        org    $180800
        move.l  #$4000000, ($4,A6)		;原来跳转破环的指令
		cmpi.b	#$1,$ffff06.l			;检测是否关卡最后场景
		beq 	_no_ID					;是，不变身		
		cmpi.b	#$2,$ffff18.l			;检测当前玩家数量是否三人
		beq		_three_player
		cmpi.b	#$1,$ffff18.l			;检测当前玩家数量是否两人
		beq		_two_player
		
;-------------------------以上均不是，则直接进入下列单人模式-------------------------------
;-------------------------单人模式：胖子、刀兵、猴子、猎人、马甲进行随机变身-------------------
_one_player	
		cmpi.w  #$28, ($20,A6)          ;是否胖子
		beq     _10_
		cmpi.w  #$38, ($20,A6)          ;是否刀兵
		beq     _10_
		cmpi.w  #$50, ($20,A6)          ;是否猴子
		beq     _10_
		cmpi.w  #$34, ($20,A6)          ;是否猎人
		beq     _10_
		cmpi.w  #$8, ($20,A6)          ;是否马甲
		beq     _10_
		rts
                

;-------------------------双人模式：狮子、链球进行随机变身----------------------------
_two_player	
		cmpi.w  #$18, ($20,A6)          ;是否狮子
		beq     _10_
		cmpi.w  #$c, ($20,A6)          ;是否链球
		beq     _90_
		rts
;-------------------------三人模式不变身----------------------------		
_three_player
		bra		_no_ID					;三人模式不变身


_10_
        move.w  #$10, ($20,A6)          ;将尸体换成6B的ID，进行复活变身
        move.w  #$100, ($26,A6)         ;设置6B为2阶状态，仅可复活一次
        rts
_90_
        move.w  #$90, ($20,A6)          ;将尸体换成马云的ID，进行变身
        move.w  #$0, ($26,A6)         ;
        rts		
_no_ID
		;move.w	#$28,($20,A6)			;把敌兵尸体换成胖子ID，尸体消失
		rts

		
;------------------------------后端-------------------------------------------------------
	org		$5f86e					;2阶与3阶6BOSS变身地址
	jmp		$190000 
	org		$190000
	cmpi.b	#$6,$ffff02.l			;优先检测是否6关关底
	beq		_6Byouti				;6关底为正常6BOSS进化
	cmpi.b	#$2,$ffff02.l			;检测是否2关关底
	beq		_tufu_fuhuo				;2关底复活屠夫
	;cmpi.b	#$0,$ffff18.l			;检测当前玩家数量是否一人
	;beq		_sjbs
	;cmpi.b	#$1,$ffff18.l			;检测当前玩家数量是否两人
	;beq		_sjbs
		
;-------------------------随机变身------------------------------------------	
_sjbs
	cmpi.b	#$0,$ff84d9.l			;检测是否第一关
	beq		_13
	cmpi.b	#$2,$ff84d9.l			;检测是否第三关
	beq		_13
_245678	
	movem.l	D0,-(A7)
	clr.l	D0
	jsr		$119c
	divu.w	#$10,D0					;取余，限制范围
	swap	D0
	mulu.w	#$2,D0	
	move.w	_SJbianshen_data(PC,D0),($20,A6)	;取下表中随机一个BOSS
	move.w	#$0,($26,A6)
	clr.l	D0
	jsr		$119c
	divu.w	#$20,D0
	swap	D0
	move.b	_sjbuji_data(PC,D0),($96,A6)			;随机补给补给
	movem.l	(A7)+,D0
	jmp		$5f87a

_SJbianshen_data
	dc.w	$0178,$011c,$0150,$00f4,$0090,$00a0,$0064,$007c
	dc.w	$00f4,$0090,$016c,$0148,$00f4,$0090,$016c,$00a0	
_sjbuji_data
	dc.w	$0e6a,$2100,$0211,$0006,$0013,$20a0,$1a1d,$0f1e
	dc.w	$0009,$000a,$0b00,$010d,$3505,$0042,$0303,$0018	
	
;-----------------------------第一三关不添加3BOSS--------------------------------	
_13
	movem.l	D0,-(A7)
	clr.l	D0
	jsr		$119c
	add.b	$ff84eA,D0				;复制随机数给D0
	divu.w	#$10,D0					;取余，限制范围
	swap	D0
	mulu.w	#$2,D0	
	move.w	_SJbianshen_data_1(PC,D0),($20,A6)	;取下表中随机一个BOSS
	move.w	#$0,($26,A6)
	cmpi.w	#$48,($26,A6)
	bne		_suijibuji
	move.w	#$200,($26,A6)
_suijibuji
	clr.l	D0
	jsr		$119c
	divu.w	#$20,D0
	swap	D0
	move.b	_sjbuji_data_1(PC,D0),($96,A6)			;随机补给补给	
	movem.l	(A7)+,D0
	jmp		$5f87a

_SJbianshen_data_1
	dc.w	$0178,$011c,$0090,$00f4,$0090,$00a0,$0064,$016c
	dc.w	$00f4,$0090,$0148,$00f4,$0150,$00a0,$0064,$0048
_sjbuji_data_1
	dc.w	$0e6a,$2100,$0011,$0006,$0013,$20a0,$1a1d,$0f1e
	dc.w	$0009,$000a,$0b00,$010d,$3505,$0042,$0303,$0018

;--------------------------------------------------------------------------------------------	
_6Byouti
	move.w	#$120,($20,A6)			;进化为6BOSS非幼体
	move.w	($26,A6),($26,A6)
	jmp		$5f87a
_tufu_fuhuo
	move.w	#$f4,($20,A6)			;复活屠夫
	move.w	#$0,($26,A6)
	jmp		$5f87a
;--------------------------------------------------------------------------------------
	;org	$605CA		;幼体出箱进阶到1阶6B变身
	;jmp	$  





*~Font name~Courier New~
*~Font size~10~
*~Tab type~1~
*~Tab size~8~
