大个子
044974: 306E 0076                  movea.w ($76,A6), A0			/目标玩家地址
044978: 3228 0008                  move.w  ($8,A0), D1		/目标玩家地址X坐标
04497C: 3428 0010                  move.w  ($10,A0), D2		/目标玩家地址Y坐标
044980: 3D41 0088                  move.w  D1, ($88,A6)		/怪物
044984: 3D42 008A                  move.w  D2, ($8a,A6)		/怪物
044988: 4EB9 0000 103A             jsr     $103a.l			/进入AI程序
04498E: 1D40 0022                  move.b  D0, ($22,A6)
044992: 4E75                       rts

00103A: 7000                       moveq   #$0, D0
00103C: 2F07                       move.l  D7, -(A7)
00103E: 362E 0008                  move.w  ($8,A6), D3		/敌兵X坐标
001042: 0681 0000 4000             addi.l  #$4000, D1
001048: 0683 0000 4000             addi.l  #$4000, D3
00104E: 9243                       sub.w   D3, D1
001050: 6400 0006                  bcc     $1058
001054: 4441                       neg.w   D1
001056: 7004                       moveq   #$4, D0
001058: 382E 0010                  move.w  ($10,A6), D4
00105C: 0682 0000 4000             addi.l  #$4000, D2
001062: 0684 0000 4000             addi.l  #$4000, D4
001068: 9444                       sub.w   D4, D2
00106A: 6400 0006                  bcc     $1072
00106E: 4442                       neg.w   D2
001070: 5440                       addq.w  #2, D0
001072: B441                       cmp.w   D1, D2
001074: 6400 0018                  bcc     $108e
001078: C342                       exg     D1, D2
00107A: 4A00                       tst.b   D0
00107C: 6700 000A                  beq     $1088
001080: 0C00 0004                  cmpi.b  #$4, D0
001084: 6600 001A                  bne     $10a0
001088: 5200                       addq.b  #1, D0
00108A: 6000 0014                  bra     $10a0
00108E: 0C00 0002                  cmpi.b  #$2, D0
001092: 6700 000A                  beq     $109e
001096: 0C00 0006                  cmpi.b  #$6, D0
00109A: 6600 0004                  bne     $10a0
00109E: 5200                       addq.b  #1, D0
0010A0: 7600                       moveq   #$0, D3
0010A2: E64A                       lsr.w   #3, D2
0010A4: 3802                       move.w  D2, D4
0010A6: D844                       add.w   D4, D4
0010A8: B441                       cmp.w   D1, D2
0010AA: 6400 0014                  bcc     $10c0
0010AE: 7E02                       moveq   #$2, D7
0010B0: 5203                       addq.b  #1, D3
0010B2: D404                       add.b   D4, D2
0010B4: B441                       cmp.w   D1, D2
0010B6: 6400 0008                  bcc     $10c0
0010BA: 51CF FFF4                  dbra    D7, $10b0
0010BE: 5203                       addq.b  #1, D3
0010C0: E708                       lsl.b   #3, D0
0010C2: 8003                       or.b    D3, D0
0010C4: 103B 0006                  move.b  ($6,PC,D0.w), D0
0010C8: 2E1F                       move.l  (A7)+, D7
0010CA: 4E75                       rts