39ADC跳过来
039BD6: 4A2E 002D                  tst.b   ($2d,A6)
039BDA: 6708                       beq     $39be4
039BDC: 422E 002D                  clr.b   ($2d,A6)
039BE0: 6100 147C                  bsr     $3b05e
*--------------------------------吃血----------------------------------------
03B05E: 302E 00D6                  move.w  ($d6,A6), D0
03B062: 0240 0007                  andi.w  #$7, D0
03B066: 6606                       bne     $3b06e
03B068: 3D6E 00D2 00D4             move.w  ($d2,A6), ($d4,A6)
03B06E: 326E 00D4                  movea.w ($d4,A6), A1
03B072: 306E 00D0                  movea.w ($d0,A6), A0
03B076: 3308                       move.w  A0, -(A1)
03B078: 3D49 00D4                  move.w  A1, ($d4,A6)
03B07C: 526E 00D6                  addq.w  #1, ($d6,A6)
03B080: 4228 0000                  clr.b   ($0,A0)
03B084: 4E75                       rts
*-------------------------------吐血----------------------------------------------------
03B086: 0C2E 0001 00B6             cmpi.b  #$1, ($b6,A6)
03B08C: 6748                       beq     $3b0d6
03B08E: 4A6E 00D6                  tst.w   ($d6,A6)		/狮子是否有消化物
03B092: 6742                       beq     $3b0d6
03B094: 326E 00D4                  movea.w ($d4,A6), A1
03B098: 2649                       movea.l A1, A3
03B09A: 3059                       movea.w (A1)+, A0
03B09C: 536E 00D6                  subq.w  #1, ($d6,A6)
03B0A0: 346E 00D2                  movea.w ($d2,A6), A2
03B0A4: B3CA                       cmpa.l  A2, A1
03B0A6: 6604                       bne     $3b0ac
03B0A8: 326E 0098                  movea.w ($98,A6), A1
03B0AC: 3D49 00D4                  move.w  A1, ($d4,A6)
03B0B0: 4253                       clr.w   (A3)
03B0B2: 117C 0001 0000             move.b  #$1, ($0,A0)
03B0B8: 317C 0000 0004             move.w  #$0, ($4,A0)
03B0BE: 117C 0002 0006             move.b  #$2, ($6,A0)
03B0C4: 316E 0008 0008             move.w  ($8,A6), ($8,A0)
03B0CA: 316E 000C 000C             move.w  ($c,A6), ($c,A0)
03B0D0: 316E 0010 0010             move.w  ($10,A6), ($10,A0)
03B0D6: 4E75                       rts