	org		$12f9a
	jsr		$2d7700
	org		$2d7700
	move.b	($5a,A0),($5a,A1)	*被破坏的指令，补回	*A0为角色，A6为武器，A1为子弹药
	
*==================检测哪些枪武器需要加倍======($39,A6)为武器种类，====================	
	tst.b	($39,A6)			*检测是否为手枪
	beq		_zidan_plus1			*手枪子弹加倍
	
	cmpi.b	#$e,($39,A6)			*检测是否为飞镖
	beq		_zidan_plus1			*飞镖加倍
	
	rts
_zidan_plus1					*再次加载一次子弹
	addi.w	#10,($12,A1)			*此时A1依然为第一倍子弹，Y坐标+10（这里可以调整两发子弹的Y距离）
*=====================第二倍子弹=====================================
	movea.l	($b0,A0),A1			*申请内存
	jsr		(A1)				*申请第二发子弹的内存，A1
	beq		_zdrts
	addq.b	#1,($0,A1)
	move.b	#$1,($16,A1)
	move.l	#$1f95e,($34,A1)
	move.w	($12,A6),($12,A1)
	subi.w	#$10,($12,A1)			*第二倍子弹，Y坐标-10（这里可以调整两发子弹的Y距离）
	move.w	($38,A6),($38,A1)
	move.b	($5a,A0),($5a,A1)
*===================第三倍子弹=============================	
	;movea.l	($b0,A0),A1			*申请内存
	;jsr		(A1)				*申请第三 发子弹的内存，A1
	;beq		_zdrts
	;addq.b	#1,($0,A1)
	;move.b	#$1,($16,A1)
	;move.l	#$1f95e,($34,A1)
	;move.w	($12,A6),($12,A1)			*第三倍子弹，Y坐标不变
	;move.w	($38,A6),($38,A1)
	;move.b	($5a,A0),($5a,A1)
_zdrts
	rts