
*3BOSS进进入屏幕外随机选取Y坐标到80上，在同步到7C上
0507DC: 326E 00A0                  movea.w ($a0,A6), A1
0507E0: 41FA 0034                  lea     ($34,PC), A0; ($50816)
0507E4: 4A2E 00A3                  tst.b   ($a3,A6)
0507E8: 6704                       beq     $507ee
0507EA: 41E8 0014                  lea     ($14,A0), A0
0507EE: 4EB9 0000 119C             jsr     $119c.l
0507F4: 0280 0000 001F             andi.l  #$1f, D0
0507FA: 7200                       moveq   #$0, D1
0507FC: 123B 0040                  move.b  ($40,PC,D0.w), D1
050800: D241                       add.w   D1, D1
050802: D241                       add.w   D1, D1
050804: D1C1                       adda.l  D1, A0
050806: 302D 0744                  move.w  ($744,A5), D0
05080A: D058                       add.w   (A0)+, D0
05080C: 3340 0008                  move.w  D0, ($8,A1)
050810: 3358 0010                  move.w  (A0)+, ($10,A1)
050814: 4E75                       rts