08C158: 0C6D A000 0744             cmpi.w  #-$6000, ($744,A5)		;对比卷轴，卷轴超过A000即跳转
08C15E: 6400 000C                  bcc     $8c16c
08C162: 0C2D 0002 0518             cmpi.b  #$2, ($518,A5)
08C168: 6600 0012                  bne     $8c17c
08C16C: 426E 006C                  clr.w   ($6c,A6)					；强制清除汽车的血量，跳车
08C170: 422D 3334                  clr.b   ($3334,A5)
08C174: 422D 34B4                  clr.b   ($34b4,A5)
08C178: 422D 3634                  clr.b   ($3634,A5)
08C17C: 4A2D 04DD                  tst.b   ($4dd,A5)
08C180: 6700 000A                  beq     $8c18c
08C184: 2D7C 0400 0000 0004        move.l  #$4000000, ($4,A6)
08C18C: 7000                       moveq   #$0, D0
08C18E: 102E 0006                  move.b  ($6,A6), D0
08C192: 303B 0006                  move.w  ($6,PC,D0.w), D0
08C196: 4EFB 0002                  jmp     ($2,PC,D0.w)
08C19A: 0004 0014                  ori.b   #$14, D4
08C19E: 0C6E 001E 006C             cmpi.w  #$1e, ($6c,A6)
08C1A4: 6400 0006                  bcc     $8c1ac
08C1A8: 542E 0006                  addq.b  #2, ($6,A6)
08C1AC: 4E75                       rts
08C1AE: 422E 0023                  clr.b   ($23,A6)
08C1B2: 522E 0080                  addq.b  #1, ($80,A6)
08C1B6: 022E 001F 0080             andi.b  #$1f, ($80,A6)
08C1BC: 0C2E 0002 0080             cmpi.b  #$2, ($80,A6)
08C1C2: 6400 0008                  bcc     $8c1cc
08C1C6: 1D7C 0084 0023             move.b  #$84, ($23,A6)
08C1CC: 4A6E 006C                  tst.w   ($6c,A6)
08C1D0: 6600 0016                  bne     $8c1e8
08C1D4: 422D 3334                  clr.b   ($3334,A5)
08C1D8: 422D 34B4                  clr.b   ($34b4,A5)
08C1DC: 422D 3634                  clr.b   ($3634,A5)
08C1E0: 2D7C 0400 0000 0004        move.l  #$4000000, ($4,A6)
08C1E8: 4E75                       rts
08C1EA: 1D7C 0084 0023             move.b  #$84, ($23,A6)
08C1F0: 532E 0059                  subq.b  #1, ($59,A6)
08C1F4: 6600 0012                  bne     $8c208
08C1F8: 422E 0023                  clr.b   ($23,A6)
08C1FC: 3D7C 0200 0004             move.w  #$200, ($4,A6)
08C202: 1D7C 0001 0000             move.b  #$1, ($0,A6)
08C208: 4E75                       rts
08C20A: 3D6E 00B2 0018             move.w  ($b2,A6), ($18,A6)
08C210: 302E 00B0                  move.w  ($b0,A6), D0
08C214: 906E 0014                  sub.w   ($14,A6), D0
08C218: 0640 0020                  addi.w  #$20, D0
08C21C: 0C40 0040                  cmpi.w  #$40, D0
08C220: 6500 001E                  bcs     $8c240
08C224: 302E 00B0                  move.w  ($b0,A6), D0
08C228: B06E 0014                  cmp.w   ($14,A6), D0
08C22C: 6400 000A                  bcc     $8c238
08C230: 046E 0030 0014             subi.w  #$30, ($14,A6)
08C236: 4E75                       rts
08C238: 066E 0030 0014             addi.w  #$30, ($14,A6)
08C23E: 4E75                       rts
08C240: 3D6E 00B0 0014             move.w  ($b0,A6), ($14,A6)
08C246: 4E75                       rts
08C248: 422E 00A8                  clr.b   ($a8,A6)
08C24C: 4A2D 3274                  tst.b   ($3274,A5)
08C250: 6700 0016                  beq     $8c268
08C254: 4A2D 3278                  tst.b   ($3278,A5)
