006C2A: 7200                       moveq   #$0, D1
006C2C: 122E 0003                  move.b  ($3,A6), D1
006C30: D041                       add.w   D1, D0
006C32: 1D7B 0006 00F9             move.b  ($6,PC,D0.w), ($f9,A6)	*动作性的无敌时间，($ec,A6)为金身无敌时间
006C38: 4E75                       rts

表格：
006C3A: 1414                       move.b  (A4), D2		*起身无敌时间
006C3C: 1414                       move.b  (A4), D2		*起身无敌时间
006C3E: 0C0A                       dc.w    $0c0a		*摔人后无敌时间
006C40: 0E12                       dc.w    $0e12		*摔人后无敌时间
006C42: 0A08                       dc.w    $0a08		*捡物后后无敌时间
006C44: 140A                       dc.w    $140a		*捡物后后无敌时间
006C46: 3C3C 3C3C                  move.w  #$3c3c, D6			*AB后无敌时间