*-----------------------------------------------------------
* 名称       :恐龙快打敌人头顶显示数字血值
* 说明       :
* 制作       :
*-----------------------------------------------------------
	ORG	$149B0
	jmp	$1a0000
	nop
	org	$1a0000
	move.w	($67c0,A5),D7   //获取当前场景中的所有对象的数量，作为循环次数
	beq	_14a52
	subq.w	#1,D7
	movea.w	($67c2,A5),A6   //对象基址列表传A6
_14a60
	movea.w	(A6)+,A0     //基址搬入A0,共4个字节，搬2次
	movea.w	(A6)+,A0
	bsr	_ht            //画图子程序调用
	dbra	D7,_14a60    //循环
 
*循环结束后，接原版数据。补上并跳回
	tst.b	($4aa,A5)
	beq	_14a52
	jmp	$149B8
_14a52
	jmp	$14A52	   //跳回
	
 *----------------------------------------------------------------------
 *D0=X坐标 D1=Y坐标 D2=砖块号 D3=色号
_ht
	cmpa.l	#$FFFFC8F4,A0  //过滤掉非敌人
	BLT	_14a52  小于转移
	cmpi.w	#$0,($6c,A0)
	ble	_14a52    //血值，小于等于0退出
	move.w	($8,A0),D0    //X
	sub.w	($69b6,A5),D0
	subq.w	#8,D0
	move.w	($c,A0),D1
	add.w	($10,A0),D1    //Y
	sub.w	($69b8,A5),D1
	not.b	D1
	addq.w	#1,D1
	sub.w	#$68,D1     //Y坐标-68，这样字符位置提升至头顶
	jsr	_1      //血值第1个字符写入
	jsr	_2      //血值第2个字符写入
	jsr	_3      //血值第3个字符写入
	rts
   
_1   
	moveq	#$0,D2 
	move.b	($6c,A0),D2     //血值传D2
	andi.b	#$f,D2        //只取个位数
	cmpi.w	#$0,D2
	beq	_tc           //如果第1个字符是0，则不画
	cmpi.w	#$8,D2
	bge	_dy            //大于等于8则跳转
	add.w	#$4e00,D2    //+砖块号基址
	bra	_xr       //跳至写入
_tc
	rts  

_dy   
	add.w	#$4e08,D2       //大于等于8的话，砖块基址改变
	bra	_xr       //跳至写入
   
_2   
	addq.w	#$8,D0     //字符间距为8，因为字符的大小就是8X8像素
	moveq	#$0,D2 
	move.b	($6d,A0),D2     //血值传D2
	lsr.b	#4,D2       //只取十位数
   
	cmpi.w	#$8,D2
	bge	_dy            //大小等于则跳转
	add.w	#$4e00,D2 
	bra	_xr       //跳至写入
   
   
_3   
	addq.w	#$8,D0         //字符间距为8
	moveq	#$0,D2 
	move.b	($6d,A0),D2     //血值传D2
	andi.b	#$f,D2       //只取个位数
	cmpi.w	#$8,D2
	bge	_dy            //大小等于则跳转
	add.w	#$4e00,D2 
   

_xr  
	moveq	#$3,D3    //色号，可以改变颜色
	movem.w	D0-D3,(A4)   //写入显存
	addq.l	#8,A4      //+8=下一个字符的显存位置
	rts    //退出
   
   
   
   






