03242E: 2B6D 3358 3354             move.l  ($3358,A5), ($3354,A5)
032434: 2B6D 34D8 34D4             move.l  ($34d8,A5), ($34d4,A5)
03243A: 2B6D 3658 3654             move.l  ($3658,A5), ($3654,A5)
032440: 1B6D 04FB 04F3             move.b  ($4fb,A5), ($4f3,A5)
032446: 7000                       moveq   #$0, D0
032448: 2B40 3358                  move.l  D0, ($3358,A5)
03244C: 2B40 34D8                  move.l  D0, ($34d8,A5)
032450: 2B40 3658                  move.l  D0, ($3658,A5)
032454: 1B40 04FB                  move.b  D0, ($4fb,A5)
032458: 7C17                       moveq   #$17, D6				/$18个内存位
03245A: 41ED 48F4                  lea     ($48f4,A5), A0			/object内存FFC8F4
03245E: 43D0                       lea     (A0), A1
032460: 41E8 00E0                  lea     ($e0,A0), A0
032464: 4A29 0000                  tst.b   ($0,A1)
032468: 6700 0064                  beq     $324ce
03246C: 1029 007D                  move.b  ($7d,A1), D0		/BOSS兵7D位为FF
032470: 6B00 005C                  bmi     $324ce
032474: 0C29 0004 0004             cmpi.b  #$4, ($4,A1)		/这是哪种敌兵？
03247A: 6400 0052                  bcc     $324ce			/大于等于4，跳
03247E: 522D 04FB                  addq.b  #1, ($4fb,A5)
032482: 4A29 0004                  tst.b   ($4,A1)			/哪种敌兵？
032486: 6700 0046                  beq     $324ce
03248A: 3469 0076                  movea.w ($76,A1), A2
03248E: 47ED 3574                  lea     ($3574,A5), A3
032492: B5CB                       cmpa.l  A3, A2
032494: 6700 0010                  beq     $324a6
032498: 47ED 33F4                  lea     ($33f4,A5), A3
03249C: B5CB                       cmpa.l  A3, A2
03249E: 6700 0006                  beq     $324a6
0324A2: 45ED 3274                  lea     ($3274,A5), A2
0324A6: 522A 00E4                  addq.b  #1, ($e4,A2)			/角色仇恨+1
0324AA: 4A00                       tst.b   D0
0324AC: 6700 0006                  beq     $324b4
0324B0: 522A 00E5                  addq.b  #1, ($e5,A2)
0324B4: 322A 0008                  move.w  ($8,A2), D1
0324B8: B269 0008                  cmp.w   ($8,A1), D1
0324BC: 6500 000C                  bcs     $324ca
0324C0: 522A 00E6                  addq.b  #1, ($e6,A2)
0324C4: 51CE FF98                  dbra    D6, $3245e
0324C8: 4E75                       rts
0324CA: 522A 00E7                  addq.b  #1, ($e7,A2)
0324CE: 51CE FF8E                  dbra    D6, $3245e
0324D2: 4E75                       rts