00A9B8: 4EB9 0001 7F8A             jsr     $17f8a.l

017F8A: 4DED 05EC                  lea     ($5ec,A5), A6
017F8E: 7000                       moveq   #$0, D0
017F90: 3D40 000E                  move.w  D0, ($e,A6)
017F94: 3D40 0012                  move.w  D0, ($12,A6)
017F98: 3D40 0010                  move.w  D0, ($10,A6)
017F9C: 3D40 0014                  move.w  D0, ($14,A6)
017FA0: 3D40 0016                  move.w  D0, ($16,A6)
017FA4: 302D 04F6                  move.w  ($4f6,A5), D0
017FA8: 41FA 010A                  lea     ($10a,PC), A0; ($180b4)
017FAC: 7200                       moveq   #$0, D1
017FAE: B058                       cmp.w   (A0)+, D0
017FB0: 6500 0014                  bcs     $17fc6
017FB4: 7210                       moveq   #$10, D1
017FB6: B058                       cmp.w   (A0)+, D0
017FB8: 6500 000C                  bcs     $17fc6
017FBC: 7220                       moveq   #$20, D1
017FBE: B058                       cmp.w   (A0)+, D0
017FC0: 6500 0004                  bcs     $17fc6
017FC4: 7230                       moveq   #$30, D1
017FC6: 102D 777B                  move.b  ($777b,A5), D0
017FCA: 0240 0007                  andi.w  #$7, D0		*实际得到难度1的指数
017FCE: D040                       add.w   D0, D0
017FD0: D041                       add.w   D1, D0
017FD2: 41FA 00E6                  lea     ($e6,PC), A0; ($180ba)
017FD6: 3030 0000                  move.w  (A0,D0.w), D0
017FDA: 41FA 011E                  lea     ($11e,PC), A0; ($180fa)
017FDE: 41F0 0000                  lea     (A0,D0.w), A0
017FE2: 4EB9 0000 119C             jsr     $119c.l
017FE8: 0240 001F                  andi.w  #$1f, D0
017FEC: 1030 0000                  move.b  (A0,D0.w), D0
017FF0: 5300                       subq.b  #1, D0
017FF2: 3D40 0004                  move.w  D0, ($4,A6)		*受难度1影响，FF85F0难度
017FF6: 426D 04F6                  clr.w   ($4f6,A5)
017FFA: 102D 777B                  move.b  ($777b,A5), D0
017FFE: 0240 0018                  andi.w  #$18, D0		*实际得到难度2的指数
018002: E648                       lsr.w   #3, D0
018004: 5240                       addq.w  #1, D0
018006: 3D40 000A                  move.w  D0, ($a,A6)		*受难度2影响
01800A: 6000 003C                  bra     $18048

018066: 302E 000A                  move.w  ($a,A6), D0		*受难度2影响
01806A: D040                       add.w   D0, D0
01806C: 41FA 074A                  lea     ($74a,PC), A0; ($187b8)
018070: 3D70 0000 000C             move.w  (A0,D0.w), ($c,A6)		*游戏难度增长时间

018702: 536E 000C                  subq.w  #1, ($c,A6)		*随时间时刻运行着
018706: 6400 0026                  bcc     $1872e			*大于0，跳

01870A: 302E 0004                  move.w  ($4,A6), D0		*FF85F0游戏难度指数
01870E: 5240                       addq.w  #1, D0			*+1，一个时间循环加1
018710: 0C40 001F                  cmpi.w  #$1f, D0
018714: 6300 0004                  bls     $1871a
018718: 701F                       moveq   #$1f, D0
01871A: 3D40 0004                  move.w  D0, ($4,A6)
01871E: 302E 000A                  move.w  ($a,A6), D0		*受难度2影响
018722: D040                       add.w   D0, D0
018724: 41FA 0092                  lea     ($92,PC), A0; ($187b8)
018728: 3D70 0000 000C             move.w  (A0,D0.w), ($c,A6)

01872E: 4A6E 000E                  tst.w   ($e,A6)
018732: 6700 0028                  beq     $1875c
018736: 536E 0012                  subq.w  #1, ($12,A6)
01873A: 6600 0020                  bne     $1875c
01873E: 536E 000E                  subq.w  #1, ($e,A6)
018742: 3D7C 0708 0012             move.w  #$708, ($12,A6)
018748: 526E 0004                  addq.w  #1, ($4,A6)
01874C: 0C6E 001F 0004             cmpi.w  #$1f, ($4,A6)
018752: 6300 0008                  bls     $1875c
018756: 3D7C 001F 0004             move.w  #$1f, ($4,A6)
01875C: 4A6E 0010                  tst.w   ($10,A6)
018760: 6700 0020                  beq     $18782
018764: 536E 0014                  subq.w  #1, ($14,A6)
018768: 6600 0018                  bne     $18782
01876C: 536E 0010                  subq.w  #1, ($10,A6)
018770: 3D7C 04B0 0014             move.w  #$4b0, ($14,A6)
018776: 536E 0004                  subq.w  #1, ($4,A6)
01877A: 6400 0006                  bcc     $18782
01877E: 426E 0004                  clr.w   ($4,A6)
018782: 4A6E 0018                  tst.w   ($18,A6)
018786: 6700 0006                  beq     $1878e
01878A: 536E 0018                  subq.w  #1, ($18,A6)
01878E: 4A6E 001A                  tst.w   ($1a,A6)
018792: 6700 0006                  beq     $1879a
018796: 536E 001A                  subq.w  #1, ($1a,A6)
01879A: 6100 FDF6                  bsr     $18592
01879E: 4A6E 001C                  tst.w   ($1c,A6)
0187A2: 6700 0012                  beq     $187b6
0187A6: 426E 0000                  clr.w   ($0,A6)
0187AA: 536E 001C                  subq.w  #1, ($1c,A6)
0187AE: 6600 0006                  bne     $187b6
0187B2: 6100 FAEE                  bsr     $182a2
0187B6: 4E75                       rts