039B0C: 306E 00D0                  movea.w ($d0,A6), A0	*血的地址，准备吃


03AFA4: 0C6E 0008 00D6             cmpi.w  #$8, ($d6,A6)	*肚子里是否大于8个道具
03AFAA: 6C42                       bge     $3afee
03AFAC: 4A2E 00B6                  tst.b   ($b6,A6)			*动作回收标志，上一个动作是否完成
03AFB0: 6A0E                       bpl     $3afc0
03AFB2: 302D 69EE                  move.w  ($69ee,A5), D0	*箱子个数
03AFB6: B06E 00D8                  cmp.w   ($d8,A6), D0
03AFBA: 6F04                       ble     $3afc0
03AFBC: 422E 00B6                  clr.b   ($b6,A6)
03AFC0: 4A2E 00B6                  tst.b   ($b6,A6)
03AFC4: 6628                       bne     $3afee
03AFC6: 302D 05EC                  move.w  ($5ec,A5), D0
03AFCA: 0240 0007                  andi.w  #$7, D0
03AFCE: 123B 0022                  move.b  ($22,PC,D0.w), D1
03AFD2: 4EB9 0000 119C             jsr     $119c.l
03AFD8: 0200 001F                  andi.b  #$1f, D0
03AFDC: B001                       cmp.b   D1, D0
03AFDE: 6C0E                       bge     $3afee
03AFE0: 4EB9 0003 2762             jsr     $32762.l			*进入搜寻
03AFE6: 6406                       bcc     $3afee
03AFE8: 44FC 0001                  move    #$1, CCR
03AFEC: 4E75                       rts
03AFEE: 8040                       or.w    D0, D0
03AFF0: 4E75                       rts


*--------------------------------搜寻--------------------------------------
032762: 7017                       moveq   #$17, D0
032764: 41ED 0874                  lea     ($874,A5), A0
032768: 4A28 0000                  tst.b   ($0,A0)
03276C: 6700 0050                  beq     $327be
032770: 3228 0020                  move.w  ($20,A0), D1
032774: 0C41 0000                  cmpi.w  #$0, D1
032778: 6700 0022                  beq     $3279c
03277C: 0C41 0008                  cmpi.w  #$8, D1		*弹匣，没有小类
032780: 6700 001A                  beq     $3279c
032784: 0C41 0010                  cmpi.w  #$10, D1
032788: 6700 0012                  beq     $3279c
03278C: 0C41 0014                  cmpi.w  #$14, D1
032790: 6700 000A                  beq     $3279c
032794: 0C41 0024                  cmpi.w  #$24, D1
032798: 6600 0024                  bne     $327be
03279C: 0C28 0002 0004             cmpi.b  #$2, ($4,A0)
0327A2: 6200 001A                  bhi     $327be
0327A6: 4A28 0005                  tst.b   ($5,A0)
0327AA: 6700 000C                  beq     $327b8
0327AE: 0C28 000C 0005             cmpi.b  #$c, ($5,A0)
0327B4: 6600 0008                  bne     $327be
0327B8: 44FC 0001                  move    #$1, CCR		*表示有食物
0327BC: 4E75                       rts
0327BE: 41E8 00C0                  lea     ($c0,A0), A0
0327C2: 51C8 FFA4                  dbra    D0, $32768
0327C6: 8000                       or.b    D0, D0
0327C8: 4E75                       rts
0327CA: 7017                       moveq   #$17, D0
0327CC: 41ED 0874                  lea     ($874,A5), A0
0327D0: 4A28 0000                  tst.b   ($0,A0)
0327D4: 6700 0048                  beq     $3281e
0327D8: 3228 0020                  move.w  ($20,A0), D1
0327DC: 0C41 0008                  cmpi.w  #$8, D1
0327E0: 6700 001A                  beq     $327fc
0327E4: 0C41 0010                  cmpi.w  #$10, D1
0327E8: 6700 0012                  beq     $327fc
0327EC: 0C41 0014                  cmpi.w  #$14, D1
0327F0: 6700 000A                  beq     $327fc
0327F4: 0C41 0024                  cmpi.w  #$24, D1
0327F8: 6600 0024                  bne     $3281e
0327FC: 0C28 0002 0004             cmpi.b  #$2, ($4,A0)
032802: 6200 001A                  bhi     $3281e
032806: 4A28 0005                  tst.b   ($5,A0)
03280A: 6700 000C                  beq     $32818
03280E: 0C28 000C 0005             cmpi.b  #$c, ($5,A0)
032814: 6600 0008                  bne     $3281e
032818: 44FC 0001                  move    #$1, CCR
03281C: 4E75                       rts
03281E: 41E8 00C0                  lea     ($c0,A0), A0
032822: 51C8 FFAC                  dbra    D0, $327d0
032826: 8000                       or.b    D0, D0
032828: 4E75                       rts

39ADC跳过来
039BD6: 4A2E 002D                  tst.b   ($2d,A6)
039BDA: 6708                       beq     $39be4
039BDC: 422E 002D                  clr.b   ($2d,A6)
039BE0: 6100 147C                  bsr     $3b05e
*--------------------------------吃血----------------------------------------
03B05E: 302E 00D6                  move.w  ($d6,A6), D0
03B062: 0240 0007                  andi.w  #$7, D0
03B066: 6606                       bne     $3b06e	*不等于0，吃过血，直接使用实时基址
03B068: 3D6E 00D2 00D4             move.w  ($d2,A6), ($d4,A6)		*($d2,A6)仓库起始基址
03B06E: 326E 00D4                  movea.w ($d4,A6), A1
03B072: 306E 00D0                  movea.w ($d0,A6), A0
03B076: 3308                       move.w  A0, -(A1)
03B078: 3D49 00D4                  move.w  A1, ($d4,A6)
03B07C: 526E 00D6                  addq.w  #1, ($d6,A6)
03B080: 4228 0000                  clr.b   ($0,A0)		*A0为道具地址，改为消失，不显示
03B084: 4E75                       rts
*-------------------------------吐血----------------------------------------------------
03B086: 0C2E 0001 00B6             cmpi.b  #$1, ($b6,A6)
03B08C: 6748                       beq     $3b0d6
03B08E: 4A6E 00D6                  tst.w   ($d6,A6)		/狮子是否有消化物
03B092: 6742                       beq     $3b0d6
03B094: 326E 00D4                  movea.w ($d4,A6), A1
03B098: 2649                       movea.l A1, A3
03B09A: 3059                       movea.w (A1)+, A0
03B09C: 536E 00D6                  subq.w  #1, ($d6,A6)
03B0A0: 346E 00D2                  movea.w ($d2,A6), A2		*A2为仓库起始基址
03B0A4: B3CA                       cmpa.l  A2, A1
03B0A6: 6604                       bne     $3b0ac
03B0A8: 326E 0098                  movea.w ($98,A6), A1
03B0AC: 3D49 00D4                  move.w  A1, ($d4,A6)
03B0B0: 4253                       clr.w   (A3)
03B0B2: 117C 0001 0000             move.b  #$1, ($0,A0)
03B0B8: 317C 0000 0004             move.w  #$0, ($4,A0)
03B0BE: 117C 0002 0006             move.b  #$2, ($6,A0)
03B0C4: 316E 0008 0008             move.w  ($8,A6), ($8,A0)
03B0CA: 316E 000C 000C             move.w  ($c,A6), ($c,A0)
03B0D0: 316E 0010 0010             move.w  ($10,A6), ($10,A0)
03B0D6: 4E75                       rts